<h1>
   <font color = "grey">Fundamentos da linguagem Python</font>
</h1>

# MÓDULO 1

## 1.1. Operadores matemáticos

In [326]:
# adição 

5 + 7

12

In [327]:
# subtração 

21 - 9

12

In [328]:
# multiplicação 

3 * 9

27

In [329]:
# divisão

59 / 3

19.666666666666668

### 1.1.1. Operação com variáveis

In [330]:
a = 39

In [331]:
b = a + 1

In [332]:
b

40

In [333]:
b * 2

80

**Aquecimento operadores matemáticos**

In [334]:
# compras 


arroz = 10
leite = 11.50
carne = 30.80
sabonete = 9.56
alvejante = 19.58

In [335]:
resultado = arroz + leite + carne + sabonete + alvejante

In [336]:
resultado

81.44

In [337]:
print('O valor total das compras é: R$', resultado)

O valor total das compras é: R$ 81.44

In [338]:
# potenciação 

2 ** 2

4

In [339]:
# módulo ou resto da divisão 

10 % 7

3

## 1.2. Operadores relacionais

In [340]:
# igualdade

700 == 90

False

In [341]:
100 == 100

True

In [342]:
80.0 == 80

True

In [343]:
# desigualdade 

3 != 7

True

In [344]:
3 != 3

False

In [345]:
# maior que 

500 > 90

True

In [346]:
90 > 500

False

In [347]:
# menor que 

500 < 90

False

In [348]:
90 < 500

True

In [349]:
# maior ou igual 

8 >= 8

True

In [350]:
5 >= 10

False

## 1.3. Operadores lógicos

**and** = e

**or** = ou 

**not** = não

**and** = se todas as alternativas forem verdadeiras

**or** = se pelo menos uma das alternativas forem verdadeiras

**not** = se for verdadeira será falso

**1.Para estudar em uma universidade, o aluno deve:**


Ter passado no vestibular

e

Estar com toda documentação necessária

e 

Estar matriculado

In [351]:
50 > 40 and 50 > 49

True

**2. Para obter flexibilidade no período de provas, o aluno deve:**

Ser militar e estar de serviço

ou 

Estar de licença maternidade

ou 

Estar de atestado médico

In [352]:
80 > 3 or 15 > 20

True

## 1.4. Laços de repetiçoes for

In [353]:
for i in range (0, 20, 3):
    print(i)

0
3
6
9
12
15
18

Essa função cria um loop de um range(sequencia numerica) 

for é função (i) é a variável in conecta ao range ( inicio da sequncia, fim da sequencia, intervalos)

In [354]:
lista = [3, 8, 44, 100]

In [355]:
for x in lista:
    print(x)

3
8
44
100

In [356]:
lista2 = [3, 8, 44, 100]

In [357]:
for i in lista2:
    
    if i % 2 == 0:
     print(i)

8
44
100

In [358]:
lista3 = [ [1,2,3], [2,3,5], [7,8,5,4,3,2] ]

In [359]:
for ii in lista3:
    print(ii)

[1, 2, 3]
[2, 3, 5]
[7, 8, 5, 4, 3, 2]

In [360]:
di = {'d1': 10,'d2': 20,'d3': 30,'d4': 40,'d5': 50, };

d2 = {'d2': 10,'d2': 20,'d2': 30,'d2': 40,'d2': 50};

In [361]:
di

{'d1': 10, 'd2': 20, 'd3': 30, 'd4': 40, 'd5': 50}

In [362]:
for i in di:
    print(i)

d1
d2
d3
d4
d5

In [363]:
di.items()

dict_items([('d1', 10), ('d2', 20), ('d3', 30), ('d4', 40), ('d5', 50)])

In [364]:
for c, v, in di.items():
    print( c, v)

d1 10
d2 20
d3 30
d4 40
d5 50

## 1.5. Laços de repetiçoes whille(enquanto)

In [365]:
k = 8

while k <= 10:
    print(k)
    
    k += 1

8
9
10

**pass, break e continue**

In [366]:
for letra in 'programador':
    if letra == 'a':
        pass
    print(letra)

p
r
o
g
r
a
m
a
d
o
r

In [367]:
for letra in 'programador':
    if letra == 'a':
        continue
    print(letra)

p
r
o
g
r
m
d
o
r

In [368]:
for letra in 'programador':
    if letra == 'a':
        break
    print(letra)

p
r
o
g
r

## 1.6. Funções

In [369]:
 def print_text():
    print('Aqui é um texto qaulquer')

In [370]:
print_text()

Aqui é um texto qaulquer

In [371]:
def print_isto(x):
    print(x)

In [372]:
print_isto(7958)

7958

In [373]:
def potencia(x):
    p = x ** 2
    return p

In [374]:
potencia(4)

16

In [375]:
def sub(x):
    r = x + 4
    return r

In [376]:
sub (1000)

1004

In [377]:
def potencia_n(x, n = 2 ):
    p = x ** n
    return p

In [378]:
potencia_n(5)

25

In [379]:
potencia_n(5, 3)

125

# MÓDULO 2

### IMPORTS

In [380]:
import pandas as pd
import numpy as np

## 2.1. Dataframes

In [381]:
series = pd.Series([7, 4, 2, np.nan, 6, 9 ])

In [382]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [383]:
type(series)

pandas.core.series.Series

In [384]:
datas = pd.date_range('20220101', periods = 6 )

In [385]:
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [386]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [387]:
df = pd.DataFrame(np.random.randn(6,4), index= datas, columns = list('ABCD'))

In [388]:
df

                   A         B         C         D
2022-01-01 -2.051975  0.752461 -2.065874 -0.657351
2022-01-02  0.588058  0.886433 -0.051583  0.491012
2022-01-03  0.706694  0.947890  0.245954 -2.345500
2022-01-04  0.580628 -0.270224 -0.216148  0.509481
2022-01-05  0.752368 -1.289725  0.003071 -0.089378
2022-01-06  0.273114  1.738508 -0.259484  0.496839

In [389]:
df2 = pd.DataFrame({'A': 7,
                    'B': pd.Timestamp('20220101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'), 
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'})

In [390]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [391]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2.2. Merge

In [392]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20,35,40,54,30,27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [393]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19,30,22,30,27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [394]:
# Registro de compras de todas unidades
compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

* Merge **inner join** junta a interceção entre as tabelas

In [395]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on= ['Id'], how='inner', suffixes= ('_A', '_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

* Merge **full join** junta a todas as informações das tabelas

In [396]:
lojas = pd.concat([cadastro_a, cadastro_b], ignore_index= True)

In [397]:
clientes_unicos = lojas.drop_duplicates(subset=['Id'])

In [398]:
clientes_unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888

* Merge **left join** junta informações do lado esquerdo da tabela

In [399]:
esquerda = pd.merge(cadastro_a, compras, how='left', on=['Id'])

In [400]:
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [401]:
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [402]:
esquerda

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  BB4563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [403]:
esquerda.groupby(['Id', 'Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
BB4563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

## 2.3. Groupby

In [404]:
dfg = pd.DataFrame({'A': ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                    
                    'B': ['um', 'um', 'dois', 'tres', 'dois', ' dois', 'um ', 'tres'],
                    
                    'C': np.random.randn(8),
                    
                    'D': np.random.randn(8)})

In [405]:
dfg

            A      B         C         D
0  verdadeiro     um  1.702891 -1.644407
1       falso     um -1.325091 -0.795486
2  verdadeiro   dois  1.274289  0.822244
3       falso   tres  0.429365  0.482464
4  verdadeiro   dois -1.587241  2.802827
5       falso   dois -1.377658 -1.588280
6  verdadeiro    um  -0.511941 -0.411800
7       falso   tres  0.345326  1.260844

#### Soma dos valores das colunas baseada na coluna A

In [406]:
dfg.groupby(['A']).sum()

                   C         D
A
falso      -1.928058 -0.640457
verdadeiro  0.877998  1.568865

#### Média dos valores das colunas baseada na coluna A

In [407]:
dfg.groupby(['A']).mean()

                   C         D
A
falso      -0.482014 -0.160114
verdadeiro  0.219500  0.392216

#### Soma dos valores das colunas baseada na coluna B

In [408]:
dfg.groupby(['B']).sum()

              C         D
B
 dois -1.377658 -1.588280
dois  -0.312952  3.625071
tres   0.774691  1.743308
um     0.377800 -2.439893
um    -0.511941 -0.411800

#### Média dos valores das colunas baseada na coluna B

In [409]:
dfg.groupby(['B']).mean()

              C         D
B
 dois -1.377658 -1.588280
dois  -0.156476  1.812536
tres   0.387346  0.871654
um     0.188900 -1.219946
um    -0.511941 -0.411800

#### Soma dos valores das colunas baseada nas colunas A e B

In [410]:
dfg.groupby(['A','B']).sum()

                         C         D
A          B
falso       dois -1.377658 -1.588280
           tres   0.774691  1.743308
           um    -1.325091 -0.795486
verdadeiro dois  -0.312952  3.625071
           um     1.702891 -1.644407
           um    -0.511941 -0.411800

## 2.4. Indexação

Todo índice em pyhon inicia em 0.

Sempre que quisermos selecionar algum objeto em uma lista, devemos considerar esse requisito.

In [411]:
lista = [ 32, 96, 11, 27]

In [412]:
lista[0]

32

Sempre que quisermos selecionar os números de trás pra frente, basta adicionar o sinal de subtração e ordenar a casa

In [413]:
lista [-1]

27

### Indexação múltlipla

In [414]:
arrays = [[1, 2, 5, 4], ['red', 'blue', 'green', 'blue']]

In [415]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,   'red'),
            (2,  'blue'),
            (5, 'green'),
            (4,  'blue')],
           names=['number', 'color'])

In [416]:
numbers = [0, 1, 2]
colors = ['green', 'purple']

**MultiIndex com produto cartesiano**

In [417]:
pd.MultiIndex.from_product([numbers, colors], names = ['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## 2.5. Reshping dados

In [418]:
datas = pd.date_range('20220101', periods= 6 )

df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [419]:
df

               var_A     var_B     var_C     var_D
2022-01-01 -0.158656  0.478816  1.401692  0.661835
2022-01-02  0.165559  0.719722  0.350317  1.171678
2022-01-03 -0.195197  0.949699 -0.740420  0.597797
2022-01-04 -0.056274  0.784752  0.208651 -0.124675
2022-01-05  0.752890  1.006933  0.855658 -2.162493
2022-01-06  1.009205  0.181378  0.358558  0.735409

In [420]:
dft = df.T

In [421]:
dft

       2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
var_A   -0.158656    0.165559   -0.195197   -0.056274    0.752890    1.009205
var_B    0.478816    0.719722    0.949699    0.784752    1.006933    0.181378
var_C    1.401692    0.350317   -0.740420    0.208651    0.855658    0.358558
var_D    0.661835    1.171678    0.597797   -0.124675   -2.162493    0.735409

In [422]:
df.shape

(6, 4)

### 2.5.1. Função pivot

In [423]:
data = pd.date_range('20220101', periods= 12 )

pessoa = ['George', 'Victor', 'Lucas']

In [424]:
data

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [425]:
nome = []

gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoa))
    gasto.append(np.round(np.random.randn()*100,2 ))
    
    nome

In [426]:
df = pd.DataFrame({'Data': data, 'Nome': nome, 'Gasto': gasto})

In [427]:
df

         Data    Nome   Gasto
0  2022-01-01  George   37.51
1  2022-01-02  George  -12.73
2  2022-01-03  Victor   71.21
3  2022-01-04  George  -94.79
4  2022-01-05   Lucas -256.38
5  2022-01-06  George   28.21
6  2022-01-07   Lucas  206.61
7  2022-01-08  George  -24.84
8  2022-01-09  George   16.53
9  2022-01-10  George  220.87
10 2022-01-11  Victor -165.13
11 2022-01-12   Lucas  282.64

In [428]:
pd.pivot(df, index= 'Data', columns= 'Nome', values= 'Gasto')

Nome        George   Lucas  Victor
Data
2022-01-01   37.51     NaN     NaN
2022-01-02  -12.73     NaN     NaN
2022-01-03     NaN     NaN   71.21
2022-01-04  -94.79     NaN     NaN
2022-01-05     NaN -256.38     NaN
2022-01-06   28.21     NaN     NaN
2022-01-07     NaN  206.61     NaN
2022-01-08  -24.84     NaN     NaN
2022-01-09   16.53     NaN     NaN
2022-01-10  220.87     NaN     NaN
2022-01-11     NaN     NaN -165.13
2022-01-12     NaN  282.64     NaN

### 2.5.2. Função pivot table

In [429]:
carros = [7, 4, 3, 2, 8]

data = pd.date_range('20220101','20220101', periods= 5 )

vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

In [430]:
df = pd.DataFrame({'Vendas': carros, 'Data': data, 'Vendedor': vendedor})

In [431]:
df

   Vendas       Data Vendedor
0       7 2022-01-01   George
1       4 2022-01-01   Vagner
2       3 2022-01-01    Pedro
3       2 2022-01-01   Vagner
4       8 2022-01-01   George

A função **pivot table** não entrega valores de index duplicados

In [432]:
pd.pivot_table(df, index= 'Data', columns= 'Vendedor', values= 'Vendas', aggfunc='sum')

Vendedor    George  Pedro  Vagner
Data
2022-01-01      15      3       6

### 2.5.3. Stack e unstack de dados

coleta de dados da internet

In [ ]:
df = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')

In [ ]:
df.head(4)

In [ ]:
df.shape

In [ ]:
#Essa função empilha os dados em uma coluna

empilhamento = df.stack()

In [ ]:
empilhamento.head(20)

In [ ]:
# Essa função reverte o processo de empilhamento

empilhamento.unstack()

### 2.5.4. Função melt

In [ ]:
df = pd.DataFrame({ 'A': {0: 'a', 1: 'b', 2: 'c'},
                    'B': {0: 1, 1: 3, 2: 5,},
                    'C': {0: 2, 1: 4, 2: 6}})

In [ ]:
df

In [ ]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

In [ ]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

In [ ]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], var_name='nome da var', value_name='valor da var')

In [ ]:
data = {
    'Localização' : ['cidadeA', 'cidadeB'], 
    'Temperatura' : ['prevista', 'atual'],
    'Set-2021':     [30, 32],
    'Out-2021':     [45, 43],
    'Nov-2021':     [24, 22]
}

print(data)

In [ ]:
df = pd.DataFrame(data, columns = ['Localização', 'Temperatura', 'Set-2021', 'Out-2021', 'Nov-2021'])
df

In [ ]:
df2 = pd.melt(df, id_vars=['Localização', 'Temperatura'], var_name='Data', value_name='Valor')

df2

## 2.6. Seleção de linhas e colunas

In [ ]:
datas = pd.date_range('20210101', periods = 600)

df = pd.DataFrame(np.random.rand(600, 5), index = datas, columns = list('ABCDE'))

In [ ]:
df.head(4)

In [ ]:
df['D'].tail(5)

In [ ]:
df[1 : 5]

In [ ]:
df.loc[:, ['B', 'C', 'D']]

**Filtragem do intervalo entre as datas especificadas e das colunas A e C**

In [ ]:
df.loc['20220101' : '20220323', ['A', 'C']].head(5)

**Filtragem de todas as colunas da linha 1**

In [ ]:
df.iloc[1]

**Filtragem de um intervalo específico entre linhas e colunas (1º intervalo linhas, 2º colunas)**

In [ ]:
df.iloc[1:4, 1: 6]

**Filtragem de linhas e colunas escolhidas**

In [ ]:
df.iloc[[7, 4, 8], [0, 3]]

**Filtros booleanos**

In [ ]:
df[df.A>0]

In [ ]:
df[df > 0]

## 2.7. Limpeza dos dados

### 2.7.1 Sumarização dos dados

In [ ]:
datas = pd.date_range('20180101', periods = 6)

df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [ ]:
df2 = pd.DataFrame({'A': pd.Timestamp('20130102'),
                    'B': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'C': np.array([3] * 4, dtype = 'int32'),
                    'D': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'
    
})

In [ ]:
df

In [ ]:
df.shape

In [ ]:
df.dtypes

In [ ]:
df2

In [ ]:
df.shape

In [ ]:
df2.dtypes